RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32E50x_Firmware_Library/GD32E50x_standard_peripheral/Include/gd32e50x_i2c.h
/* I2C flag definitions of I2Cx(x=2) */
#define I2C2_FLAG_TBE                    I2C2_STAT_TBE                         /*!< I2C_TDATA is empty during transmitting */
#define I2C2_FLAG_TI                     I2C2_STAT_TI                          /*!< transmit interrupt */
#define I2C2_FLAG_RBNE                   I2C2_STAT_RBNE                        /*!< I2C_RDATA is not empty during receiving */
#define I2C2_FLAG_ADDSEND                I2C2_STAT_ADDSEND                     /*!< address received matches in slave mode */
#define I2C2_FLAG_NACK                   I2C2_STAT_NACK                        /*!< not acknowledge flag */
#define I2C2_FLAG_STPDET                 I2C2_STAT_STPDET                      /*!< STOP condition detected in slave mode */
#define I2C2_FLAG_TC                     I2C2_STAT_TC                          /*!< transfer complete in master mode */
#define I2C2_FLAG_TCR                    I2C2_STAT_TCR                         /*!< transfer complete reload */
#define I2C2_FLAG_BERR                   I2C2_STAT_BERR                        /*!< bus error */
#define I2C2_FLAG_LOSTARB                I2C2_STAT_LOSTARB                     /*!< arbitration lost */
#define I2C2_FLAG_OUERR                  I2C2_STAT_OUERR                       /*!< overrun/underrun error in slave mode */
#define I2C2_FLAG_PECERR                 I2C2_STAT_PECERR                      /*!< PEC error */
#define I2C2_FLAG_TIMEOUT                I2C2_STAT_TIMEOUT                     /*!< timeout flag */
#define I2C2_FLAG_SMBALT                 I2C2_STAT_SMBALT                      /*!< SMBus Alert */
#define I2C2_FLAG_I2CBSY                 I2C2_STAT_I2CBSY                      /*!< busy flag */
#define I2C2_FLAG_TR                     I2C2_STAT_TR                          /*!< whether the I2C is a transmitter or a receiver in slave mode */

/* I2C interrupt flags */
/* I2C interrupt flags of I2Cx(x=0,1) */
typedef enum {
    /* interrupt flags in CTL1 register */
    I2C_INT_FLAG_SBSEND = I2C_REGIDX_BIT2(I2C_CTL1_REG_OFFSET, 9U, I2C_STAT0_REG_OFFSET, 0U),        /*!< start condition sent out in master mode interrupt flag */
    I2C_INT_FLAG_ADDSEND = I2C_REGIDX_BIT2(I2C_CTL1_REG_OFFSET, 9U, I2C_STAT0_REG_OFFSET, 1U),       /*!< address is sent in master mode or received and matches in slave mode interrupt flag */
    I2C_INT_FLAG_BTC =  I2C_REGIDX_BIT2(I2C_CTL1_REG_OFFSET, 9U, I2C_STAT0_REG_OFFSET, 2U),          /*!< byte transmission finishes */
    I2C_INT_FLAG_ADD10SEND =  I2C_REGIDX_BIT2(I2C_CTL1_REG_OFFSET, 9U, I2C_STAT0_REG_OFFSET, 3U),    /*!< header of 10-bit address is sent in master mode interrupt flag */
    I2C_INT_FLAG_STPDET = I2C_REGIDX_BIT2(I2C_CTL1_REG_OFFSET, 9U, I2C_STAT0_REG_OFFSET, 4U),        /*!< stop condition detected in slave mode interrupt flag */
    I2C_INT_FLAG_RBNE = I2C_REGIDX_BIT2(I2C_CTL1_REG_OFFSET, 9U, I2C_STAT0_REG_OFFSET, 6U),          /*!< I2C_DATA is not Empty during receiving interrupt flag */
    I2C_INT_FLAG_TBE = I2C_REGIDX_BIT2(I2C_CTL1_REG_OFFSET, 9U, I2C_STAT0_REG_OFFSET, 7U),           /*!< I2C_DATA is empty during transmitting interrupt flag */
    I2C_INT_FLAG_BERR = I2C_REGIDX_BIT2(I2C_CTL1_REG_OFFSET, 8U, I2C_STAT0_REG_OFFSET, 8U),          /*!< a bus error occurs indication a unexpected start or stop condition on I2C bus interrupt flag */
    I2C_INT_FLAG_LOSTARB = I2C_REGIDX_BIT2(I2C_CTL1_REG_OFFSET, 8U, I2C_STAT0_REG_OFFSET, 9U),       /*!< arbitration lost in master mode interrupt flag */
    I2C_INT_FLAG_AERR = I2C_REGIDX_BIT2(I2C_CTL1_REG_OFFSET, 8U, I2C_STAT0_REG_OFFSET, 10U),         /*!< acknowledge error interrupt flag */
    I2C_INT_FLAG_OUERR = I2C_REGIDX_BIT2(I2C_CTL1_REG_OFFSET, 8U, I2C_STAT0_REG_OFFSET, 11U),        /*!< over-run or under-run situation occurs in slave mode interrupt flag */
    I2C_INT_FLAG_PECERR = I2C_REGIDX_BIT2(I2C_CTL1_REG_OFFSET, 8U, I2C_STAT0_REG_OFFSET, 12U),       /*!< PEC error when receiving data interrupt flag */
    I2C_INT_FLAG_SMBTO = I2C_REGIDX_BIT2(I2C_CTL1_REG_OFFSET, 8U, I2C_STAT0_REG_OFFSET, 14U),        /*!< timeout signal in SMBus mode interrupt flag */
    I2C_INT_FLAG_SMBALT = I2C_REGIDX_BIT2(I2C_CTL1_REG_OFFSET, 8U, I2C_STAT0_REG_OFFSET, 15U),       /*!< SMBus Alert status interrupt flag */
    /* interrupt flags in SAMCS register */
    I2C_INT_FLAG_TFF = I2C_REGIDX_BIT2(I2C_SAMCS_REG_OFFSET, 4U, I2C_SAMCS_REG_OFFSET, 12U),         /*!< txframe fall interrupt flag */
    I2C_INT_FLAG_TFR = I2C_REGIDX_BIT2(I2C_SAMCS_REG_OFFSET, 5U, I2C_SAMCS_REG_OFFSET, 13U),         /*!< txframe rise interrupt  flag */
    I2C_INT_FLAG_RFF = I2C_REGIDX_BIT2(I2C_SAMCS_REG_OFFSET, 6U, I2C_SAMCS_REG_OFFSET, 14U),         /*!< rxframe fall interrupt flag */
    I2C_INT_FLAG_RFR = I2C_REGIDX_BIT2(I2C_SAMCS_REG_OFFSET, 7U, I2C_SAMCS_REG_OFFSET, 15U),         /*!< rxframe rise interrupt flag */
    /* interrupt flags in control and status register */
    I2C_INT_FLAG_STLO = I2C_REGIDX_BIT2(I2C_CS_REG_OFFSET, 8U, I2C_CS_REG_OFFSET, 0U),               /*!< start lost interrupt flag */
    I2C_INT_FLAG_STPSEND = I2C_REGIDX_BIT2(I2C_CS_REG_OFFSET, 9U, I2C_CS_REG_OFFSET, 1U)             /*!< stop condition sent interrupt flag */
} i2c_interrupt_flag_enum;

/* I2C interrupt flags of I2Cx(x=2) */
typedef enum {
    I2C2_INT_FLAG_TI = I2C_REGIDX_BIT2(I2C2_CTL0_REG_OFFSET, 1U, I2C2_STAT_REG_OFFSET, 1U),          /*!< transmit interrupt flag */
    I2C2_INT_FLAG_RBNE = I2C_REGIDX_BIT2(I2C2_CTL0_REG_OFFSET, 2U, I2C2_STAT_REG_OFFSET, 2U),        /*!< I2C_RDATA is not empty during receiving interrupt flag */
    I2C2_INT_FLAG_ADDSEND = I2C_REGIDX_BIT2(I2C2_CTL0_REG_OFFSET, 3U, I2C2_STAT_REG_OFFSET, 3U),     /*!< address received matches in slave mode interrupt flag */
    I2C2_INT_FLAG_NACK = I2C_REGIDX_BIT2(I2C2_CTL0_REG_OFFSET, 4U, I2C2_STAT_REG_OFFSET, 4U),        /*!< not acknowledge interrupt flag */
    I2C2_INT_FLAG_STPDET = I2C_REGIDX_BIT2(I2C2_CTL0_REG_OFFSET, 5U, I2C2_STAT_REG_OFFSET, 5U),      /*!< stop condition detected in slave mode interrupt flag */
    I2C2_INT_FLAG_TC = I2C_REGIDX_BIT2(I2C2_CTL0_REG_OFFSET, 6U, I2C2_STAT_REG_OFFSET, 6U),          /*!< transfer complete in master mode interrupt flag */
    I2C2_INT_FLAG_TCR = I2C_REGIDX_BIT2(I2C2_CTL0_REG_OFFSET, 6U, I2C2_STAT_REG_OFFSET, 7U),         /*!< transfer complete reload interrupt flag */
    I2C2_INT_FLAG_BERR = I2C_REGIDX_BIT2(I2C2_CTL0_REG_OFFSET, 7U, I2C2_STAT_REG_OFFSET, 8U),        /*!< bus error interrupt flag */
    I2C2_INT_FLAG_LOSTARB = I2C_REGIDX_BIT2(I2C2_CTL0_REG_OFFSET, 7U, I2C2_STAT_REG_OFFSET, 9U),     /*!< arbitration lost interrupt flag */
    I2C2_INT_FLAG_OUERR = I2C_REGIDX_BIT2(I2C2_CTL0_REG_OFFSET, 7U, I2C2_STAT_REG_OFFSET, 10U),      /*!< overrun/underrun error in slave mode interrupt flag */
    I2C2_INT_FLAG_PECERR = I2C_REGIDX_BIT2(I2C2_CTL0_REG_OFFSET, 7U, I2C2_STAT_REG_OFFSET, 11U),     /*!< PEC error interrupt flag */
    I2C2_INT_FLAG_TIMEOUT = I2C_REGIDX_BIT2(I2C2_CTL0_REG_OFFSET, 7U, I2C2_STAT_REG_OFFSET, 12U),    /*!< timeout interrupt flag */
    I2C2_INT_FLAG_SMBALT = I2C_REGIDX_BIT2(I2C2_CTL0_REG_OFFSET, 7U, I2C2_STAT_REG_OFFSET, 13U)      /*!< SMBus Alert interrupt flag */
} i2c2_interrupt_flag_enum;

/* I2C interrupt of I2Cx(x=0,1) */
typedef enum {
    /* interrupt in CTL1 register */
    I2C_INT_ERR = I2C_REGIDX_BIT(I2C_CTL1_REG_OFFSET, 8U),                     /*!< error interrupt */
    I2C_INT_EV = I2C_REGIDX_BIT(I2C_CTL1_REG_OFFSET, 9U),                      /*!< event interrupt */
    I2C_INT_BUF = I2C_REGIDX_BIT(I2C_CTL1_REG_OFFSET, 10U),                    /*!< buffer interrupt */
    /* interrupt in SAMCS register */
    I2C_INT_TFF = I2C_REGIDX_BIT(I2C_SAMCS_REG_OFFSET, 4U),                    /*!< txframe fall interrupt  */
    I2C_INT_TFR = I2C_REGIDX_BIT(I2C_SAMCS_REG_OFFSET, 5U),                    /*!< txframe rise interrupt */
    I2C_INT_RFF = I2C_REGIDX_BIT(I2C_SAMCS_REG_OFFSET, 6U),                    /*!< rxframe fall interrupt */
    I2C_INT_RFR = I2C_REGIDX_BIT(I2C_SAMCS_REG_OFFSET, 7U),                    /*!< rxframe rise interrupt */
    /* interrupt in control and status register */
    I2C_INT_STLO = I2C_REGIDX_BIT(I2C_CS_REG_OFFSET, 8U),                      /*!< start lost interrupt */
    I2C_INT_STPSEND = I2C_REGIDX_BIT(I2C_CS_REG_OFFSET, 9U)                    /*!< stop condition sent interrupt */
} i2c_interrupt_enum;

/* I2C interrupt of I2Cx(x=2) */
#define I2C2_INT_ERR                     I2C2_CTL0_ERRIE                       /*!< error interrupt */
#define I2C2_INT_TC                      I2C2_CTL0_TCIE                        /*!< transfer complete interrupt */
#define I2C2_INT_STPDET                  I2C2_CTL0_STPDETIE                    /*!< stop detection interrupt */
#define I2C2_INT_NACK                    I2C2_CTL0_NACKIE                      /*!< not acknowledge received interrupt */
#define I2C2_INT_ADDM                    I2C2_CTL0_ADDMIE                      /*!< address match interrupt */
#define I2C2_INT_RBNE                    I2C2_CTL0_RBNEIE                      /*!< receive interrupt */
#define I2C2_INT_TI                      I2C2_CTL0_TIE                         /*!< transmit interrupt */

/* I2C status register bit clear */
#define CLEAR_STPDET                     I2C_STATC_STOPFC                      /*!< clear STPDET bit in I2C_STAT0 */
#define CLEAR_ADD10SEND                  I2C_STATC_ADD10SENDC                  /*!< clear ADD10SEND bit in I2C_STAT0 */
#define CLEAR_BTC                        I2C_STATC_BTCC                        /*!< clear BTC bit in I2C_STAT0 */
#define CLEAR_ADDSEND                    I2C_STATC_ADDSENDC                    /*!< clear ADDSEND bit in I2C_STAT0 */
#define CLEAR_SBSEND                     I2C_STATC_SBSENDC                     /*!< clear SBSEND bit in I2C_STAT0 */

/* I2C start early termination mode */
#define STANDARD_I2C_PROTOCOL_MODE       ((uint32_t)0x00000000U)               /*!< do as the standard i2c protocol */
#define ARBITRATION_LOST_MODE            I2C_CTL2_SETM                         /*!< do the same thing as arbitration lost */

/* SMBus/I2C mode switch and SMBus type selection */
#define I2C_I2CMODE_ENABLE               ((uint32_t)0x00000000U)               /*!< I2C mode */
#define I2C_SMBUSMODE_ENABLE             I2C_CTL0_SMBEN                        /*!< SMBus mode */

/* SMBus/I2C mode switch and SMBus type selection */
#define I2C_SMBUS_DEVICE                 ((uint32_t)0x00000000U)               /*!< SMBus mode device type */
#define I2C_SMBUS_HOST                   I2C_CTL0_SMBSEL                       /*!< SMBus mode host type */

/* I2C transfer direction */
#define I2C_RECEIVER                     ((uint32_t)0x00000001U)               /*!< receiver */
#define I2C_TRANSMITTER                  ((uint32_t)0xFFFFFFFEU)               /*!< transmitter */

/* whether or not to send an ACK */
#define I2C_ACK_DISABLE                  ((uint32_t)0x00000000U)               /*!< ACK will be not sent */
#define I2C_ACK_ENABLE                   I2C_CTL0_ACKEN                        /*!< ACK will be sent */

/* I2C POAP position*/
#define I2C_ACKPOS_CURRENT               ((uint32_t)0x00000000U)               /*!< ACKEN bit decides whether or not to send ACK or not for the current byte */
#define I2C_ACKPOS_NEXT                  I2C_CTL0_POAP                         /*!< ACKEN bit decides whether or not to send ACK for the next byte */

/* software reset I2C */
#define I2C_SRESET_RESET                 ((uint32_t)0x00000000U)               /*!< I2C is not under reset */
#define I2C_SRESET_SET                   I2C_CTL0_SRESET                       /*!< I2C is under reset */

/* I2C DMA mode configure */
/* DMA mode switch */
#define I2C_DMA_OFF                      ((uint32_t)0x00000000U)               /*!< disable DMA mode */
#define I2C_DMA_ON                       I2C_CTL1_DMAON                        /*!< enable DMA mode */

/* flag indicating DMA last transfer */
#define I2C_DMALST_OFF                   ((uint32_t)0x00000000U)               /*!< next DMA EOT is not the last transfer */
#define I2C_DMALST_ON                    I2C_CTL1_DMALST                       /*!< next DMA EOT is the last transfer */

/* I2C PEC configure */
/* PEC enable */
#define I2C_PEC_DISABLE                  ((uint32_t)0x00000000U)               /*!< PEC calculation off */
#define I2C_PEC_ENABLE                   I2C_CTL0_PECEN                        /*!< PEC calculation on */

/* I2C SMBus configure */
/* issue or not alert through SMBA pin */
#define I2C_SALTSEND_DISABLE             ((uint32_t)0x00000000U)               /*!< not issue alert through SMBA */
#define I2C_SALTSEND_ENABLE              I2C_CTL0_SALT                         /*!< issue alert through SMBA pin */

/* ARP protocol in SMBus switch */
#define I2C_ARP_DISABLE                  ((uint32_t)0x00000000U)               /*!< disable ARP */
#define I2C_ARP_ENABLE                   I2C_CTL0_ARPEN                        /*!< enable ARP */

/* fast mode plus enable */
#define I2C_FAST_MODE_PLUS_DISABLE       ((uint32_t)0x00000000U)               /*!< disable fast mode plus */
#define I2C_FAST_MODE_PLUS_ENABLE        I2C_CTL2_FMPEN                        /*!< enable fast mode plus */

