RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32E50x_Firmware_Library/GD32E50x_standard_peripheral/Include/gd32e50x_i2c.h
/* I2C duty cycle in fast mode or fast mode plus */
#define I2C_DTCY_2                       ((uint32_t)0x00000000U)               /*!< in I2C fast mode or fast mode plus Tlow/Thigh = 2 */
#define I2C_DTCY_16_9                    I2C_CKCFG_DTCY                        /*!< in I2C fast mode or fast mode plus Tlow/Thigh = 16/9 */

/* address mode for the I2C slave */
#define I2C_ADDFORMAT_7BITS              ((uint32_t)0x00000000U)               /*!< address format is 7 bits */
#define I2C_ADDFORMAT_10BITS             I2C_SADDR0_ADDFORMAT                  /*!< address format is 10 bits */

/* I2C DMA constants definitions */
#define I2C2_DMA_TRANSMIT                ((uint32_t)0x00000000U)               /*!< I2C transmit data use DMA */
#define I2C2_DMA_RECEIVE                 ((uint32_t)0x00000001U)               /*!< I2C receive data use DMA */

/* I2C transfer direction in master mode */
#define I2C2_MASTER_TRANSMIT             ((uint32_t)0x00000000U)               /*!< I2C master transmit */
#define I2C2_MASTER_RECEIVE              I2C2_CTL1_TRDIR                       /*!< I2C master receive */

/* address mode for the I2C slave */
#define I2C2_ADDFORMAT_7BITS             ((uint32_t)0x00000000U)               /*!< address:7 bits */
#define I2C2_ADDFORMAT_10BITS            I2C2_SADDR0_ADDFORMAT                 /*!< address:10 bits */

/* defines which bits of register ADDRESS[7:1] are compared with an incoming address byte */
#define ADDRESS_BIT1_COMPARE             ((uint32_t)0x00000200U)               /*!< address bit1 needs compare */
#define ADDRESS_BIT2_COMPARE             ((uint32_t)0x00000400U)               /*!< address bit2 needs compare */
#define ADDRESS_BIT3_COMPARE             ((uint32_t)0x00000800U)               /*!< address bit3 needs compare */
#define ADDRESS_BIT4_COMPARE             ((uint32_t)0x00001000U)               /*!< address bit4 needs compare */
#define ADDRESS_BIT5_COMPARE             ((uint32_t)0x00002000U)               /*!< address bit5 needs compare */
#define ADDRESS_BIT6_COMPARE             ((uint32_t)0x00004000U)               /*!< address bit6 needs compare */
#define ADDRESS_BIT7_COMPARE             ((uint32_t)0x00008000U)               /*!< address bit7 needs compare */

/* the length of filter spikes */
#define FILTER_DISABLE                   ((uint32_t)0x00000000U)               /*!< digital filter is disabled */
#define FILTER_LENGTH_1                  ((uint32_t)0x00000001U)               /*!< digital filter is enabled and filter spikes with a length of up to 1 tI2CCLK */
#define FILTER_LENGTH_2                  ((uint32_t)0x00000002U)               /*!< digital filter is enabled and filter spikes with a length of up to 2 tI2CCLK */
#define FILTER_LENGTH_3                  ((uint32_t)0x00000003U)               /*!< digital filter is enabled and filter spikes with a length of up to 3 tI2CCLK */
#define FILTER_LENGTH_4                  ((uint32_t)0x00000004U)               /*!< digital filter is enabled and filter spikes with a length of up to 4 tI2CCLK */
#define FILTER_LENGTH_5                  ((uint32_t)0x00000005U)               /*!< digital filter is enabled and filter spikes with a length of up to 5 tI2CCLK */
#define FILTER_LENGTH_6                  ((uint32_t)0x00000006U)               /*!< digital filter is enabled and filter spikes with a length of up to 6 tI2CCLK */
#define FILTER_LENGTH_7                  ((uint32_t)0x00000007U)               /*!< digital filter is enabled and filter spikes with a length of up to 7 tI2CCLK */
#define FILTER_LENGTH_8                  ((uint32_t)0x00000008U)               /*!< digital filter is enabled and filter spikes with a length of up to 8 tI2CCLK */
#define FILTER_LENGTH_9                  ((uint32_t)0x00000009U)               /*!< digital filter is enabled and filter spikes with a length of up to 9 tI2CCLK */
#define FILTER_LENGTH_10                 ((uint32_t)0x0000000AU)               /*!< digital filter is enabled and filter spikes with a length of up to 10 tI2CCLK */
#define FILTER_LENGTH_11                 ((uint32_t)0x0000000BU)               /*!< digital filter is enabled and filter spikes with a length of up to 11 tI2CCLK */
#define FILTER_LENGTH_12                 ((uint32_t)0x0000000CU)               /*!< digital filter is enabled and filter spikes with a length of up to 12 tI2CCLK */
#define FILTER_LENGTH_13                 ((uint32_t)0x0000000DU)               /*!< digital filter is enabled and filter spikes with a length of up to 13 tI2CCLK */
#define FILTER_LENGTH_14                 ((uint32_t)0x0000000EU)               /*!< digital filter is enabled and filter spikes with a length of up to 14 tI2CCLK */
#define FILTER_LENGTH_15                 ((uint32_t)0x0000000FU)               /*!< digital filter is enabled and filter spikes with a length of up to 15 tI2CCLK */

/* defines which bits of ADDRESS2[7:1] are compared with an incoming address byte, and which bits are masked (don��t care) */
#define ADDRESS2_NO_MASK                 ((uint32_t)0x00000000U)               /*!< no mask, all the bits must be compared */
#define ADDRESS2_MASK_BIT1               ((uint32_t)0x00000001U)               /*!< ADDRESS2[1] is masked, only ADDRESS2[7:2] are compared */
#define ADDRESS2_MASK_BIT1_2             ((uint32_t)0x00000002U)               /*!< ADDRESS2[2:1] is masked, only ADDRESS2[7:3] are compared */
#define ADDRESS2_MASK_BIT1_3             ((uint32_t)0x00000003U)               /*!< ADDRESS2[3:1] is masked, only ADDRESS2[7:4] are compared */
#define ADDRESS2_MASK_BIT1_4             ((uint32_t)0x00000004U)               /*!< ADDRESS2[4:1] is masked, only ADDRESS2[7:5] are compared */
#define ADDRESS2_MASK_BIT1_5             ((uint32_t)0x00000005U)               /*!< ADDRESS2[5:1] is masked, only ADDRESS2[7:6] are compared */
#define ADDRESS2_MASK_BIT1_6             ((uint32_t)0x00000006U)               /*!< ADDRESS2[6:1] is masked, only ADDRESS2[7] are compared */
#define ADDRESS2_MASK_ALL                ((uint32_t)0x00000007U)               /*!< all the ADDRESS2[7:1] bits are masked */

/* idle clock timeout detection */
#define BUSTOA_DETECT_SCL_LOW            ((uint32_t)0x00000000U)               /*!< BUSTOA is used to detect SCL low timeout */
#define BUSTOA_DETECT_IDLE               I2C2_TIMEOUT_TOIDLE                   /*!< BUSTOA is used to detect both SCL and SDA high timeout when the bus is idle */

/* function declarations */
/* functions of I2C0~2 */
/* reset I2C */
void i2c_deinit(uint32_t i2c_periph);
/* enable I2C */
void i2c_enable(uint32_t i2c_periph);
/* disable I2C */
void i2c_disable(uint32_t i2c_periph);
/* generate a START condition on I2C bus */
void i2c_start_on_bus(uint32_t i2c_periph);
/* generate a STOP condition on I2C bus */
void i2c_stop_on_bus(uint32_t i2c_periph);
/* enable the response to a general call */
void i2c_slave_response_to_gcall_enable(uint32_t i2c_periph);
/* disable the response to a general call */
void i2c_slave_response_to_gcall_disable(uint32_t i2c_periph);
/* enable to stretch SCL low when data is not ready in slave mode */
void i2c_stretch_scl_low_enable(uint32_t i2c_periph);
/* disable to stretch SCL low when data is not ready in slave mode */
void i2c_stretch_scl_low_disable(uint32_t i2c_periph);
/* I2C transmit data function */
void i2c_data_transmit(uint32_t i2c_periph, uint32_t data);
/* I2C receive data function */
uint32_t i2c_data_receive(uint32_t i2c_periph);
/* I2C transfers PEC value */
void i2c_pec_transfer(uint32_t i2c_periph);
/* enable I2C PEC calculation */
void i2c_pec_enable(uint32_t i2c_periph);
/* disable I2C PEC calculation */
void i2c_pec_disable(uint32_t i2c_periph);
/* get packet error checking value */
uint32_t i2c_pec_value_get(uint32_t i2c_periph);

/* functions of I2C0, I2C1 */
/* configure I2C clock */
void i2c_clock_config(uint32_t i2c_periph, uint32_t clkspeed, uint32_t dutycyc);
/* configure I2C address */
void i2c_mode_addr_config(uint32_t i2c_periph, uint32_t mode, uint32_t addformat, uint32_t addr);
/* select SMBus type */
void i2c_smbus_type_config(uint32_t i2c_periph, uint32_t type);
/* whether or not to send an ACK */
void i2c_ack_config(uint32_t i2c_periph, uint32_t ack);
/* configure I2C POAP position */
void i2c_ackpos_config(uint32_t i2c_periph, uint32_t pos);
/* master sends slave address */
void i2c_master_addressing(uint32_t i2c_periph, uint32_t addr, uint32_t trandirection);
/* enable dual-address mode */
void i2c_dualaddr_enable(uint32_t i2c_periph, uint32_t addr);
/* disable dual-address mode */
void i2c_dualaddr_disable(uint32_t i2c_periph);

